import { Card, Space, Select, Layout} from "antd";

const IpCard = () => {
  return (
    <>
      <Space direction="vertical" size={16} style={{ position: "relative", display: "flex", flexDirection: "row" }}>
        <div className="first__column">

          <Card className="first__card">
            <div className="container__ipcard">
              <div className="title__ipcard">
                <h1 className="heading__ipcard">
                  ИП Пирогова И.А
                </h1>
              </div>
              <div>
                <div className="first__line">

                  <svg width="15" height="20" viewBox="0 0 15 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fillRule="evenodd" clipRule="evenodd" d="M7.5 1.5C4.20122 1.5 1.5 4.20478 1.5 7.54902C1.5 8.56026 1.83256 9.73882 2.41479 11.0003C2.99137 12.2496 3.77514 13.5 4.58772 14.6325C5.71656 16.2059 6.86398 17.5011 7.5 18.1864C8.13602 17.5011 9.28344 16.2059 10.4123 14.6325C11.2249 13.5 12.0086 12.2496 12.5852 11.0003C13.1674 9.73882 13.5 8.56026 13.5 7.54902C13.5 4.20478 10.7988 1.5 7.5 1.5ZM6.93095 19.7633C6.78797 19.6188 5.06123 17.8656 3.36896 15.507C2.5228 14.3276 1.68236 12.9929 1.05285 11.6289C0.424191 10.2668 0 8.86306 0 7.54902C0 3.38558 3.3636 0 7.5 0C11.6364 0 15 3.38558 15 7.54902C15 8.86306 14.5758 10.2668 13.9472 11.6289C13.3176 12.9929 12.4772 14.3276 11.631 15.507C9.93877 17.8656 8.21203 19.6188 8.06905 19.7633L8.06805 19.7644C7.91113 19.9207 7.70555 20 7.5 20C7.29445 20 7.08888 19.9207 6.93195 19.7644L6.93095 19.7633Z" fill="#C90000" />
                    <path fillRule="evenodd" clipRule="evenodd" d="M7.50403 5C6.12693 5 5.00403 6.1229 5.00403 7.5C5.00403 8.8771 6.12693 10 7.50403 10C8.88113 10 10.004 8.8771 10.004 7.5C10.004 6.1229 8.88113 5 7.50403 5ZM3.50403 7.5C3.50403 5.29447 5.2985 3.5 7.50403 3.5C9.70955 3.5 11.504 5.29447 11.504 7.5C11.504 9.70553 9.70955 11.5 7.50403 11.5C5.2985 11.5 3.50403 9.70553 3.50403 7.5Z" fill="#C90000" />
                  </svg>
                  <p>
                    с.Сарыг-Сеп, ул.40 лет Октября 12
                  </p>
                </div>
                <div className="second__line">
                  <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M10.75 5.41666C10.75 5.00244 10.4142 4.66666 10 4.66666C9.58579 4.66666 9.25 5.00244 9.25 5.41666V9.99999C9.25 10.2361 9.36115 10.4583 9.55 10.6L12.8833 13.1C13.2147 13.3485 13.6848 13.2814 13.9333 12.95C14.1819 12.6186 14.1147 12.1485 13.7833 11.9L10.75 9.62499V5.41666Z" fill="#C90000" />
                    <path fillRule="evenodd" clipRule="evenodd" d="M20 10C20 15.5228 15.5228 20 10 20C4.47715 20 0 15.5228 0 10C0 4.47715 4.47715 0 10 0C15.5228 0 20 4.47715 20 10ZM18.5 10C18.5 14.6944 14.6944 18.5 10 18.5C5.30558 18.5 1.5 14.6944 1.5 10C1.5 5.30558 5.30558 1.5 10 1.5C14.6944 1.5 18.5 5.30558 18.5 10Z" fill="#C90000" />
                  </svg>
                  <p>
                    9:00 - 18:00 (сейчас работает)
                  </p>
                </div>
                <div className="third__line">

                  <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M11 2C12.8565 2 14.637 2.7375 15.9497 4.05025C17.2625 5.36301 18 7.14348 18 9C18 9.26521 18.1054 9.51957 18.2929 9.7071C18.4804 9.89464 18.7348 10 19 10C19.2652 10 19.5196 9.89464 19.7071 9.7071C19.8946 9.51957 20 9.26521 20 9C20 6.61305 19.0518 4.32386 17.364 2.63604C15.6761 0.948211 13.3869 0 11 0C10.7348 0 10.4804 0.105357 10.2929 0.292893C10.1054 0.480429 10 0.734783 10 1C10 1.26522 10.1054 1.51957 10.2929 1.70711C10.4804 1.89464 10.7348 2 11 2ZM19.75 13.91C19.695 13.7495 19.6 13.6056 19.4741 13.4919C19.3481 13.3781 19.1953 13.2983 19.03 13.26L13.03 11.89C12.8671 11.8531 12.6976 11.8575 12.5369 11.9029C12.3762 11.9483 12.2294 12.0333 12.11 12.15C11.97 12.28 11.96 12.29 11.31 13.53C9.1532 12.5362 7.42499 10.8009 6.44 8.64C7.71 8 7.72 8 7.85 7.85C7.96671 7.73055 8.05165 7.58378 8.09706 7.42308C8.14248 7.26238 8.14693 7.09286 8.11 6.93L6.74 1C6.70164 0.834696 6.62186 0.681871 6.50814 0.555911C6.39443 0.429952 6.25053 0.335002 6.09 0.28C5.85647 0.196589 5.61531 0.1363 5.37 0.0999999C5.11725 0.0413952 4.85933 0.00789934 4.6 0C3.38 0 2.20998 0.484641 1.34731 1.34731C0.484641 2.20998 0 3.38 0 4.6C0.00529192 8.68271 1.62949 12.5967 4.5164 15.4836C7.40331 18.3705 11.3173 19.9947 15.4 20C16.0041 20 16.6022 19.881 17.1603 19.6498C17.7184 19.4187 18.2255 19.0798 18.6527 18.6527C19.0798 18.2255 19.4187 17.7184 19.6498 17.1603C19.881 16.6022 20 16.0041 20 15.4C20.0003 15.1455 19.9802 14.8913 19.94 14.64C19.898 14.3916 19.8344 14.1474 19.75 13.91ZM15.4 18C11.8469 17.9973 8.44011 16.5847 5.92769 14.0723C3.41528 11.5599 2.00265 8.15309 2 4.6C2.00263 3.91125 2.27741 3.25146 2.76443 2.76443C3.25146 2.27741 3.91125 2.00263 4.6 2H4.93L6 6.64L5.46 6.92C4.6 7.37 3.92 7.73 4.28 8.51C4.86622 10.1696 5.81477 11.6777 7.05673 12.9249C8.2987 14.172 9.80288 15.1269 11.46 15.72C12.3 16.06 12.63 15.43 13.08 14.56L13.37 14.01L18 15.07V15.4C17.9974 16.0887 17.7226 16.7485 17.2356 17.2356C16.7485 17.7226 16.0887 17.9974 15.4 18Z" fill="#C90000" />
                  </svg>

                  <p>
                    +7 (999) 999 99 99
                  </p>
                </div>
              </div>
            </div>
          </Card>
          <Card className="second__card" >
            {/* <Tabless /> */}
          </Card>
        </div>
        <div className="second__column">

          <Card className="third__card" style={{ width: "100%" }}>
            <div>
              <h1 className="heading__calculator__card" style={{ width: "100%" }}>
                Калькулятор расчета стоимости угля
              </h1>
            </div>
            <div className="button__container__card">
              <p className="paragraph__calculate__name">Район</p>
              <Select placeholder="Каа-Хемский район">
                <Select.Option>asd</Select.Option>

              </Select>
              <p className="paragraph__calculate__name">Необходимое количество в тоннах</p>
              <Select placeholder="3">

                <Select.Option>asd</Select.Option>

              </Select>
              <p className="paragraph__calculate__name">Сорт угля</p>
              <Select placeholder="Каа-Хемский район">
                <Select.Option>asd</Select.Option>

              </Select>
              <p className="paragraph__calculate__name">Доставка</p>
              <Select placeholder="Нужна">
                <Select.Option>asd</Select.Option>

              </Select>


            </div>
            <div className="button__container__calc">
              <button className="button__clear">
                Очистить
              </button>
              <button className="button__calculate">
                Рассчитать
              </button>
            </div>
            <div className="footer__container__paragraph">

              <ul className="ul__footer__paragraph">
                <li>Все цены указаны в российских рублях</li>
                <li>Цены на уголь указаны в рассчете на одну тонну(1000 килограммов)</li>
                <li>Стоимость доставки зависит от количества угля и расстоянния до адреса заказчика</li>
                <li>Формаула рассчета стоимости доставки может отличаться в зависимости от выбранного склада</li>
                <li>Центр управления регионом не несет ответственности за недостоверность данных и информации, предоставленной складом</li>
              </ul>
            </div>
          </Card>
        </div>
      </Space>
    </>
  );
};

export default IpCard;